OpenAtomFoundation/TobudOS/board/NUCLEO_STM32L053R8/BSP/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define B1_Pin GPIO_PIN_13
#define B1_GPIO_Port GPIOC
#define B1_EXTI_IRQn EXTI4_15_IRQn
#define LSM6DS3_INT1_Pin GPIO_PIN_1
#define LSM6DS3_INT1_GPIO_Port GPIOA
#define LSM6DS3_INT1_EXTI_IRQn EXTI0_1_IRQn
#define USART_TX_Pin GPIO_PIN_2
#define USART_TX_GPIO_Port GPIOA
#define USART_RX_Pin GPIO_PIN_3
#define USART_RX_GPIO_Port GPIOA
#define LSM6DS3_INT2_Pin GPIO_PIN_4
#define LSM6DS3_INT2_GPIO_Port GPIOA
#define LSM6DS3_INT2_EXTI_IRQn EXTI4_15_IRQn
#define LD2_Pin GPIO_PIN_5
#define LD2_GPIO_Port GPIOA
#define LIS3MDL_DRDY_Pin GPIO_PIN_6
#define LIS3MDL_DRDY_GPIO_Port GPIOA
#define LIS3MDL_INT1_Pin GPIO_PIN_7
#define LIS3MDL_INT1_GPIO_Port GPIOA
#define LIS3MDL_INT1_EXTI_IRQn EXTI4_15_IRQn
#define LPS22HB_INT1_Pin GPIO_PIN_10
#define LPS22HB_INT1_GPIO_Port GPIOB
#define LPS22HB_INT1_EXTI_IRQn EXTI4_15_IRQn
#define NRST_Pin GPIO_PIN_7
#define NRST_GPIO_Port GPIOC
#define HTS221_DRDY_Pin GPIO_PIN_8
#define HTS221_DRDY_GPIO_Port GPIOA
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
